app/views/posts/show.html.erb

<h3 class="text-white">Все комментарии</h3>
<% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]