app/controllers/posts_controller.rb

def create
    @post = Post.new(post_params)
    @post.user = current_user


    if (@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Ffffff"], ["body", "Fdsadasd"], ["created_at", "2018-12-20 10:23:31.496531"], ["updated_at", "2018-12-20 10:23:31.496531"], ["user_id", 1]]