app/controllers/users_controller.rb

  def update
  @user = User.find(params[:id])

     if(@user.update(post_params))
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$01g/Wv8rPlJKgq9atw/Z9ej.4fRjfTYen1Fxcz8eS9EmQA5.H1EMi"], ["updated_at", "2018-12-13 12:13:06.137438"], ["id", 2]]